# This is a "Brewfile" that its packages are sorted arbitrarily
# to clarify the installed packages.
# A normal file that lists the installed packages can be created
# by `brew bundle dump` (overwrited with `-f`).
# Run `brew bundle --file macos/arm64/Brewfile` to install the listed packages
# and uninstall packages not being listed.
# To update packages, it seems `brew upgrade` may be needed and then run `brew bundle`.

#------------------------------------------------
# Taps
#------------------------------------------------
# cf. https://docs.brew.sh/Taps

tap "homebrew/bundle"
tap "homebrew/services"
# https://developer.hashicorp.com/terraform/tutorials/aws-get-started/install-cli
tap "hashicorp/tap"

#------------------------------------------------
# Formulae
#------------------------------------------------
brew "bdw-gc"

brew "brew-cask-completion"
brew "launchctl-completion"
brew "open-completion"
# brew "vagrant-completion"
brew "docker-completion"

brew "openssl@3"
brew "bash" # Newer version
brew "bash-completion@2"
brew "zsh"
brew "rename"
brew "tree"
brew "pstree"
brew "htop"
brew "nmap"
brew "wget"
brew "tmux"
brew "rsync" # Newer version
brew "xxhash" # for rsync
brew "bat" # Alternative to `cat`
brew "eza" # Alternative to `ls`
brew "fd" # Alternative to `find`
brew "ripgrep" # (`rg`) Alternative to `grep`
brew "git"
# brew "ffmpeg"
# brew "harfbuzz" # Dependency of `ffmpeg`

brew "nvm"
brew "yarn"
brew "yarn-completion"
brew "pnpm"
brew "pyenv"
brew "pip-completion"
brew "pipx"

brew "act" # Local Github Actions
brew "awscli"
brew "hashicorp/tap/terraform"

# Stable diffusion Web UI
# cf. https://github.com/AUTOMATIC1111/stable-diffusion-webui/wiki/Installation-on-Apple-Silicon#automatic-installation
brew "cmake"
brew "protobuf"
brew "rust"
brew "python@3.10"

#------------------------------------------------
# Casks
#------------------------------------------------
# cf. https://github.com/Homebrew/homebrew-cask

cask "font-noto-nerd-font"
cask "android-file-transfer"
cask "clipy"
cask "karabiner-elements"
cask "google-japanese-ime"
cask "google-chrome"
cask "syncthing"
cask "lulu"
# cask "tunnelbear"
cask "protonvpn"
cask "libreoffice"
# cask "kindle"
cask "slack"
cask "docker"
cask "visual-studio-code"
cask "dbeaver-community"
cask "android-platform-tools"
# cask "send-anywhere"

#------------------------------------------------
# VSCode
#------------------------------------------------
# It seems there is no mention about this in the doc.
# cf. https://github.com/Homebrew/homebrew-bundle/blob/master/lib/bundle/dsl.rb

# Theme
vscode "pkief.material-icon-theme" # Icons of file and directory

# Remote environment
vscode "ms-vscode-remote.remote-ssh" # SSH
vscode "ms-vscode-remote.remote-ssh-edit" # (`remote-ssh` complement)
vscode "ms-vscode-remote.remote-containers" # Docker containers
vscode "ms-vscode.remote-explorer" # (`remote-` complement)

# Highlighting
vscode "shardulm94.trailing-spaces" # Spaces
vscode "oderwat.indent-rainbow" # Each tab step
vscode "usernamehw.errorlens" # Inline error messages
vscode "naumovs.color-highlight" # Web colors
vscode "irongeek.vscode-env" # Env
vscode "ibm.output-colorizer" # Log
vscode "mechatroner.rainbow-csv" # CSV
vscode "jeff-hykin.better-shellscript-syntax" # Shellscript
vscode "jeff-hykin.better-dockerfile-syntax" # Dockerfile
vscode "xadillax.viml" # Vimrc
vscode "mariusschulz.yarn-lock-syntax" # Yarn

# Utilities
vscode "streetsidesoftware.code-spell-checker"
vscode "artdiniz.quitcontrol-vscode" # Show confirmation before closing window
vscode "aaron-bond.better-comments" # create many kinds of colorized comments
vscode "wmaurer.change-case" # (Command Palette -> Change Case xxx)
vscode "quicktype.quicktype" # paste JSON as selected lang
vscode "ms-playwright.playwright" # Playwight testing tool
vscode "sourcegraph.cody-ai"  # AI-powered code completion

# Git
vscode "eamodio.gitlens"
vscode "donjayamanne.githistory"

# Intellisense
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.intellicode-api-usage-examples" # Code example

# Docker
vscode "ms-azuretools.vscode-docker"

# Bash
vscode "mads-hartmann.bash-ide-vscode"
vscode "rogalmic.bash-debug"

# CSV
vscode "grapecity.gc-excelviewer"

# YAML
vscode "redhat.vscode-yaml"

# Nginx
vscode "ahmadalli.vscode-nginx-conf"

# HTML CSS
vscode "vincaslt.highlight-matching-tag"
vscode "ecmel.vscode-html-css"  # `id` and `class` attribute completion
vscode "bradlc.vscode-tailwindcss"

# JS/TS
vscode "christian-kohler.path-intellisense"
vscode "ms-vscode.vscode-typescript-next"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "wix.vscode-import-cost" # Import size calculator
# React
vscode "dsznajder.es7-react-js-snippets"
# Vue
# vscode "vue.volar"

# PHP Laravel
vscode "xdebug.php-debug"
vscode "bmewburn.vscode-intelephense-client"
vscode "amiralizadeh9480.laravel-extra-intellisense"

# Python
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.flake8"
vscode "ms-python.debugpy"
# vscode "ms-python.black-formatter"
# vscode "ms-python.isort"
# vscode "kevinrose.vsc-python-indent"

# Terraform
vscode "hashicorp.terraform"

# Serverless
vscode "threadheap.serverless-ide-vscode"

# Github Actions
vscode "github.vscode-github-actions"

# Markdown
vscode "yzhang.markdown-all-in-one"
vscode "davidanson.vscode-markdownlint"
vscode "shd101wyy.markdown-preview-enhanced"
