# This is a "Brewfile" that its packages are sorted arbitrarily
# to clarify the installed packages.
# A normal file that lists the installed packages can be created
# by `brew bundle dump` (overwrited with `-f`).
# Run `brew bundle --file macos/Brewfile` to install the listed packages
# and remove those not being listed.

#------------------------------------------------
# Taps
#------------------------------------------------
# cf. https://docs.brew.sh/Taps

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts" # For `exa` icons

#------------------------------------------------
# Formulae
#------------------------------------------------

brew "brew-cask-completion"
brew "launchctl-completion"
brew "open-completion"
brew "vagrant-completion"
brew "docker-completion"

brew "openssl@3"
brew "bash" # Newer version
brew "bash-completion@2"
brew "zsh"
brew "rename"
brew "tree"
brew "pstree"
brew "htop"
brew "nmap"
brew "wget"
brew "tmux"
brew "rsync" # Newer version
brew "bat" # Alternative to `cat`
brew "exa" # Alternative to `ls`
brew "fd" # Alternative to `find`
brew "ripgrep" # (`rg`) Alternative to `grep`
brew "git"
brew "ffmpeg"
brew "harfbuzz" # Dependency of `ffmpeg`

brew "yarn"
brew "yarn-completion"
brew "nodenv"
brew "node-build" # Dependency of `nodenv`
brew "pyenv"
brew "pip-completion"
brew "rbenv"

# Possible dependencies of `phpenv`
brew "bzip2"
brew "libiconv"
brew "libzip"
brew "oniguruma"
brew "tidy-html5"

brew "act" # Local Github Actions
brew "awscli"
brew "terraform"

#------------------------------------------------
# Casks
#------------------------------------------------
# cf. https://github.com/Homebrew/homebrew-cask

cask "font-noto-nerd-font"

cask "clipy"
cask "karabiner-elements"
cask "google-japanese-ime"
cask "google-chrome"
cask "libreoffice"

# Communication
cask "slack"

# Developer
cask "docker"
cask "virtualbox"
cask "vagrant"
cask "visual-studio-code"
cask "mysqlworkbench"
# cask "sequel-ace"
# cask "pgadmin4"

# Miscellaneous
cask "kindle"
cask "send-anywhere"
cask "iina"
