tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "act"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "brew-cask-completion"
brew "bzip2"
brew "docker-completion"
brew "docker-compose-completion"
brew "exa"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "git"
brew "htop"
brew "launchctl-completion"
brew "libiconv"
brew "pango"
brew "libzip"
brew "nmap"
brew "node-build"
brew "nodenv"
brew "oniguruma"
brew "open-completion"
brew "openssl@3"
brew "pip-completion"
brew "pstree"
brew "pyenv"
brew "rbenv"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "terraform"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "vagrant-completion"
brew "wget"
brew "yarn"
brew "yarn-completion"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "docker"
cask "karabiner-elements"
cask "libreoffice"
cask "mysqlworkbench"
cask "sequel-ace"
cask "slack"
cask "vagrant"
cask "virtualbox"
