# VSCode Extensions

# Theme
PKief.material-icon-theme # Icons of file and directory

# Remote environment
ms-vscode-remote.remote-ssh # SSH
ms-vscode-remote.remote-ssh-edit # (`remote-ssh` complement)
ms-vscode-remote.remote-containers # Docker containers
ms-vscode.remote-explorer # (`remote-` complement)

# Intellisense
VisualStudioExptTeam.vscodeintellicode
christian-kohler.path-intellisense # Path

# Highlighting
shardulm94.trailing-spaces # Spaces
oderwat.indent-rainbow # Each tab step
usernamehw.errorlens # Error messages inline
naumovs.color-highlight # Web colors
IronGeek.vscode-env # .env
IBM.output-colorizer # Logfile
mechatroner.rainbow-csv # CSV
jeff-hykin.better-shellscript-syntax # Shellscript
XadillaX.viml # .vimrc
jeff-hykin.better-dockerfile-syntax # Dockerfile
mariusschulz.yarn-lock-syntax # Yarn

# Utilities
streetsidesoftware.code-spell-checker
artdiniz.quitcontrol-vscode # Show confirmation before closing window
aaron-bond.better-comments # create many kinds of colorized comments
wmaurer.change-case # (Command Palette -> Change Case xxx)
quicktype.quicktype # paste JSON as code
VisualStudioExptTeam.intellicode-api-usage-examples # Code example
ms-playwright.playwright # Playwight testing tool

# Git
donjayamanne.githistory
eamodio.gitlens # View all info from sidebar

# Docker
ms-azuretools.vscode-docker

# Bash
mads-hartmann.bash-ide-vscode
rogalmic.bash-debug # Debugger

# YAML
# redhat.vscode-yaml # Enable YAML schema

# HTML CSS
formulahendry.auto-rename-tag
vincaslt.highlight-matching-tag
ecmel.vscode-html-css # Class, Id attribute completion.
bradlc.vscode-tailwindcss # Completion

# JS/TS
ms-vscode.vscode-typescript-next # TS
dbaeumer.vscode-eslint # Linter
esbenp.prettier-vscode # Formatter including HTML, JSON, Markdown, etc
wix.vscode-import-cost # Import size calculator
dsznajder.es7-react-js-snippets

# PHP Laravel
bmewburn.vscode-intelephense-client
amiralizadeh9480.laravel-extra-intellisense

# Python
ms-python.python
ms-python.vscode-pylance # Python language server
ms-python.isort # Import sorting
KevinRose.vsc-python-indent # Smarter indent

# Terraform
hashicorp.terraform

# Serverless
ThreadHeap.serverless-ide-vscode

# Github Actions
cschleiden.vscode-github-actions # Completion etc

# Markdown
yzhang.markdown-all-in-one
DavidAnson.vscode-markdownlint
shd101wyy.markdown-preview-enhanced
