alefragnani.Bookmarks
bigonesystems.django
chrmarti.regex
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
GitHub.vscode-pull-request-github
IBM.output-colorizer
ICS.japanese-proofreading
ionutvmi.path-autocomplete
jcbuisson.vue
jebbs.plantuml
KevinRose.vsc-python-indent
leizongmin.node-module-intellisense
magicstack.MagicPython
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-python.python
ms-vscode-remote.remote-containers
naumovs.color-highlight
octref.vetur
oderwat.indent-rainbow
onecentlin.laravel-blade
onecentlin.laravel5-snippets
PKief.material-icon-theme
quicktype.quicktype
rebornix.ruby
redhat.java
ritwickdey.LiveServer
rogalmic.bash-debug
ryu1kn.partial-diff
saikou9901.evilinspector
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
vscode.theme-monokai
tushortz.python-extended-snippets
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wholroyd.jinja
wingrunr21.vscode-ruby
yzhang.markdown-all-in-one
