# VSCode Extensions

# Theme
dracula-theme.theme-dracula # Color theme
PKief.material-icon-theme # Icons of file and directory

# Remote environment
ms-vscode-remote.remote-ssh # SSH
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-containers # Docker containers

# Intellisense
VisualStudioExptTeam.vscodeintellicode
christian-kohler.path-intellisense # Path
bradlc.vscode-tailwindcss # Tailwind CSS

# Highlighting
shardulm94.trailing-spaces # Spaces
oderwat.indent-rainbow # Each tab step
usernamehw.errorlens # Error messages inline
naumovs.color-highlight # Web colors
irongeek.vscode-env # .env
IBM.output-colorizer # Logfile
mechatroner.rainbow-csv # CSV
jeff-hykin.better-shellscript-syntax # Shellscript
jeff-hykin.better-dockerfile-syntax # Dockerfile

# Utilities
streetsidesoftware.code-spell-checker
artdiniz.quitcontrol-vscode # Show confirmation before closing window
aaron-bond.better-comments # create many kinds of colorized comments
wmaurer.change-case # (Command Palette -> Change Case xxx)
quicktype.quicktype # paste JSON as code

# Git
donjayamanne.githistory
eamodio.gitlens # View all info from sidebar

# Docker
ms-azuretools.vscode-docker

# Bash
mads-hartmann.bash-ide-vscode
rogalmic.bash-debug # Debugger

# HTML CSS
formulahendry.auto-rename-tag
vincaslt.highlight-matching-tag
ecmel.vscode-html-css # Class, Id attribute completion.

# Tailwind CSS
bradlc.vscode-tailwindcss # Completion

# JS/TS
ms-vscode.vscode-typescript-next # TS
dbaeumer.vscode-eslint # Linter
esbenp.prettier-vscode # Formatter including HTML, JSON, Markdown, etc
wix.vscode-import-cost # Import size calculator
dsznajder.es7-react-js-snippets

# PHP Laravel
bmewburn.vscode-intelephense-client

# Python
ms-python.python
ms-python.vscode-pylance # Python language server
KevinRose.vsc-python-indent # Smarter indent

# Terraform
hashicorp.terraform

# Serverless
threadheap.serverless-ide-vscode

# Markdown
yzhang.markdown-all-in-on
DavidAnson.vscode-markdownlint
shd101wyy.markdown-preview-enhanced

# PlantUML
jebbs.plantuml
